In [11]:
import pandas as pd
import numpy as np
import seaborn as sns

In [12]:
data = pd.read_stata("../../data/CDP Cleaning/cleaned outputs/cdp_methane.dta")

In [13]:
data.shape

(13503, 3)

In [21]:
data.head()

    id  methane_emissions    year
0   64           6.969791  2010.0
1   87          13.555148  2010.0
2  143           0.000000  2010.0
3  156           0.000000  2010.0
4  209           2.079442  2010.0

In [15]:
data.columns

Index(['id', 'methane_emissions', 'year'], dtype='object')

In [16]:
# check that there are no duplicates
data[data.duplicated(subset=['id', 'year'])]

Empty DataFrame
Columns: [id, methane_emissions, year]
Index: []

Taking the log1p of methane emissions

In [17]:
data['methane_emissions'] = np.log1p(data['methane_emissions'])

In [18]:
data.head()

    id  methane_emissions    year
0   64           6.969791  2010.0
1   87          13.555148  2010.0
2  143           0.000000  2010.0
3  156           0.000000  2010.0
4  209           2.079442  2010.0

In [19]:
data.shape

(13503, 3)

In [20]:
# save the df final to csv in the processed data folder
data.to_csv('../../data/processed/cdp_methane_processed.csv', index=False)